app/controllers/articles_controller.rb

INSERT INTO "articles" ("title", "description", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["title", "My article title"], ["description", "My article description"], ["created_at", "2019-06-08 09:23:30.494027"], ["updated_at", "2019-06-08 09:23:30.494027"]]
---
  def create
    @article = Article.new
    @article.title = params[:title]
    @article.description = params[:description]
    @article.created_at = DateTime.now

UPDATE "articles" SET "title" = ?, "description" = ?, "updated_at" = ? WHERE "articles"."id" = ?  [["title", nil], ["description", nil], ["updated_at", "2019-06-08 09:22:44.595799"], ["id", 1]]
---
  def update
     @article.update(title: params[:article][:title], description: params[:article][:description], updated_at: DateTime.now)